#include <stdio.h>

void main(){
	//Создание переменных a,b,c
	float a,b,c;
	printf("Решить уравнение ax+b=c.\n");
	do {
		printf("Задайте коэфициент a(a не равно нулю): ");
		//Присвоение переменной "a" значения с клавиатуры
		scanf("%f",&a);
	} while (a == 0);
	//printf("Введено не допустимое число!");
	printf("Задайте коэфициент b: ");
	//Присвоение переменной "b" значения с клавиатуры
	scanf("%f",&b);
	printf("Задайте коэфициент c: ");
	//Присвоение переменной "c" значения с клавиатуры
	scanf("%f",&c);
	//Вывод решения уравнения ax+b=c
	printf("Значение аргумента x: %f\n",(c-b)/a);
}	
